## Introduction to Data Science

### Introduction to Pandas

In [65]:
import os
import pathlib
import time
import random
import math

import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

#pd.set_option('display.max_rows', 500)
#pd.set_option('display.max_columns', 500)
#pd.set_option('display.width', 1000)

#import pylab
%matplotlib inline
#%matplotlib notebook

### Pandas Data Structures: Series

In [2]:
obj = pd.Series([4, 7, -5, 3, 5])
obj

0    4
1    7
2   -5
3    3
4    5
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3,  5])

In [4]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan', 'Fernie']
obj

Bob       4
Steve     7
Jeff     -5
Ryan      3
Fernie    5
dtype: int64

In [6]:
obj['Bob']

4

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2['c']

3

In [9]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [10]:
obj2[obj2 < 0]

a   -5
dtype: int64

In [11]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [12]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [13]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [14]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [15]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [16]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [17]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [18]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### Pandas Data Structures: Dataframe

In [19]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],'year': [2000, 2001, 2002, 2001, 2002],'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [20]:
frame['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
Name: pop, dtype: float64

In [21]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [22]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [23]:
frame2['nova'] = 13
frame2

       year   state  pop debt  nova
one    2000    Ohio  1.5  NaN    13
two    2001    Ohio  1.7  NaN    13
three  2002    Ohio  3.6  NaN    13
four   2001  Nevada  2.4  NaN    13
five   2002  Nevada  2.9  NaN    13

In [24]:
frame2.nova = 23
frame2

       year   state  pop debt  nova
one    2000    Ohio  1.5  NaN    23
two    2001    Ohio  1.7  NaN    23
three  2002    Ohio  3.6  NaN    23
four   2001  Nevada  2.4  NaN    23
five   2002  Nevada  2.9  NaN    23

In [25]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'nova'], dtype='object')

In [26]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [27]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [28]:
#frame2.loc['three']
frame2.loc['three','state']

'Ohio'

In [29]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5  16.5    23
two    2001    Ohio  1.7  16.5    23
three  2002    Ohio  3.6  16.5    23
four   2001  Nevada  2.4  16.5    23
five   2002  Nevada  2.9  16.5    23

In [30]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5   0.0    23
two    2001    Ohio  1.7   1.0    23
three  2002    Ohio  3.6   2.0    23
four   2001  Nevada  2.4   3.0    23
five   2002  Nevada  2.9   4.0    23

In [31]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5   NaN    23
two    2001    Ohio  1.7  -1.2    23
three  2002    Ohio  3.6   NaN    23
four   2001  Nevada  2.4  -1.5    23
five   2002  Nevada  2.9  -1.7    23

In [32]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  nova  eastern
one    2000    Ohio  1.5   NaN    23     True
two    2001    Ohio  1.7  -1.2    23     True
three  2002    Ohio  3.6   NaN    23     True
four   2001  Nevada  2.4  -1.5    23    False
five   2002  Nevada  2.9  -1.7    23    False

In [33]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'nova'], dtype='object')

In [34]:
transpose = frame2.pivot(index= 'year', columns='state', values='pop') 
transpose

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [35]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [36]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [37]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [38]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [39]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [40]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame4 = pd.DataFrame(pop)
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [41]:
frame4.loc[2000,'Nevada'] = 2
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [42]:
frame5 = pd.concat([frame4, frame4])
frame5

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [43]:
frame5.drop_duplicates(['Nevada'])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [44]:
dates = pd.date_range("20160101", periods=10)
data = np.random.random((10,3))
column_names = ['Column1', 'Column2', 'Column3']
df = pd.DataFrame(data, index=dates, columns=column_names)
df.head(10)

             Column1   Column2   Column3
2016-01-01  0.168098  0.810316  0.170663
2016-01-02  0.468232  0.986742  0.116786
2016-01-03  0.481076  0.827217  0.192947
2016-01-04  0.224805  0.439735  0.486376
2016-01-05  0.536749  0.658015  0.983972
2016-01-06  0.519812  0.300515  0.659889
2016-01-07  0.774335  0.430021  0.050430
2016-01-08  0.187742  0.774001  0.882513
2016-01-09  0.765308  0.002681  0.420695
2016-01-10  0.287973  0.700085  0.899802

In [45]:
df[1:3]

             Column1   Column2   Column3
2016-01-02  0.468232  0.986742  0.116786
2016-01-03  0.481076  0.827217  0.192947

In [46]:
df['20160104':'20160107']

             Column1   Column2   Column3
2016-01-04  0.224805  0.439735  0.486376
2016-01-05  0.536749  0.658015  0.983972
2016-01-06  0.519812  0.300515  0.659889
2016-01-07  0.774335  0.430021  0.050430

In [47]:
df.loc['20160101':'20160102',['Column1','Column3']]

             Column1   Column3
2016-01-01  0.168098  0.170663
2016-01-02  0.468232  0.116786

In [48]:
df.iloc[3:5, 0:2]

             Column1   Column2
2016-01-04  0.224805  0.439735
2016-01-05  0.536749  0.658015

In [49]:
df.describe()

         Column1    Column2    Column3
count  10.000000  10.000000  10.000000
mean    0.441413   0.592933   0.486407
std     0.221807   0.296207   0.353127
min     0.168098   0.002681   0.050430
25%     0.240597   0.432449   0.176234
50%     0.474654   0.679050   0.453535
75%     0.532515   0.801238   0.826857
max     0.774335   0.986742   0.983972

In [50]:
df.sort_index(axis=0, ascending=False,) # inplace=True)

             Column1   Column2   Column3
2016-01-10  0.287973  0.700085  0.899802
2016-01-09  0.765308  0.002681  0.420695
2016-01-08  0.187742  0.774001  0.882513
2016-01-07  0.774335  0.430021  0.050430
2016-01-06  0.519812  0.300515  0.659889
2016-01-05  0.536749  0.658015  0.983972
2016-01-04  0.224805  0.439735  0.486376
2016-01-03  0.481076  0.827217  0.192947
2016-01-02  0.468232  0.986742  0.116786
2016-01-01  0.168098  0.810316  0.170663

In [51]:
df.sort_values(by='Column2')

             Column1   Column2   Column3
2016-01-09  0.765308  0.002681  0.420695
2016-01-06  0.519812  0.300515  0.659889
2016-01-07  0.774335  0.430021  0.050430
2016-01-04  0.224805  0.439735  0.486376
2016-01-05  0.536749  0.658015  0.983972
2016-01-10  0.287973  0.700085  0.899802
2016-01-08  0.187742  0.774001  0.882513
2016-01-01  0.168098  0.810316  0.170663
2016-01-03  0.481076  0.827217  0.192947
2016-01-02  0.468232  0.986742  0.116786

In [52]:
dates1 = pd.date_range("20160101", periods=6)
data1 = np.random.random((6,2))
column_names1 = ['ColumnA', 'ColumnB']

dates2 = pd.date_range("20160101", periods=7)
data2 = np.random.random((7,2))
column_names2 = ['ColumnC', 'ColumnD']

df1 = pd.DataFrame(data1, index=dates1, columns=column_names1)
df2 = pd.DataFrame(data2, index=dates2, columns=column_names2)

In [53]:
df1.head()

             ColumnA   ColumnB
2016-01-01  0.011992  0.208796
2016-01-02  0.312463  0.280494
2016-01-03  0.937728  0.563194
2016-01-04  0.551877  0.938964
2016-01-05  0.734183  0.575707

In [54]:
df2.head()

             ColumnC   ColumnD
2016-01-01  0.707781  0.947257
2016-01-02  0.529665  0.805287
2016-01-03  0.124795  0.951941
2016-01-04  0.203040  0.570355
2016-01-05  0.304034  0.834825

In [55]:
df1.join(df2)

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-01  0.011992  0.208796  0.707781  0.947257
2016-01-02  0.312463  0.280494  0.529665  0.805287
2016-01-03  0.937728  0.563194  0.124795  0.951941
2016-01-04  0.551877  0.938964  0.203040  0.570355
2016-01-05  0.734183  0.575707  0.304034  0.834825
2016-01-06  0.169407  0.472331  0.556099  0.207704

In [56]:
df3 = df1.join(df2)

# add a column to df to group on
df3['ProfitLoss'] = pd.Series(['Profit', 
                               'Loss', 
                               'Profit', 
                               'Profit', 
                               'Profit', 
                               'Loss', 
                               'Profit', 
                               'Profit', 
                               'Profit', 
                               'Loss'], index=dates)

In [57]:
df3.head()

             ColumnA   ColumnB   ColumnC   ColumnD ProfitLoss
2016-01-01  0.011992  0.208796  0.707781  0.947257     Profit
2016-01-02  0.312463  0.280494  0.529665  0.805287       Loss
2016-01-03  0.937728  0.563194  0.124795  0.951941     Profit
2016-01-04  0.551877  0.938964  0.203040  0.570355     Profit
2016-01-05  0.734183  0.575707  0.304034  0.834825     Profit

In [58]:
df3.groupby('ProfitLoss').mean()

             ColumnA   ColumnB   ColumnC   ColumnD
ProfitLoss
Loss        0.240935  0.376413  0.542882  0.506495
Profit      0.558945  0.571665  0.334912  0.826094

### Pandas Functions

#### idmin & idmax

In [59]:
df3['ColumnA'].idxmax()

Timestamp('2016-01-03 00:00:00', freq='D')

In [60]:
df3['ColumnA'].idxmin()

Timestamp('2016-01-01 00:00:00', freq='D')

ne()

In [61]:
df = pd.DataFrame()
df['x'] = [0,0,0,0,0,0,1,2,3,4,5,6,7]
df['x'].ne(0)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8      True
9      True
10     True
11     True
12     True
Name: x, dtype: bool

In [62]:
df['x'].ne(0).idxmax()

6

In [63]:
df['x'].nsmallest(3)

0    0
1    0
2    0
Name: x, dtype: int64

In [64]:
df.nlargest(3, 'x')

    x
12  7
11  6
10  5

#### Pandas.melt()

In [77]:
# Create a test dataframe
# Untidy dataframe
# x : Subjects
# y : Student names

marks = pd.DataFrame(np.random.randint(0, 100, size = (30,5)), 
                     columns = ['Maths', 'Physics','Chemistry', 'Biology', 'Computer_Science'])

In [78]:
# Add student column to dataset
marks['Student'] = ['Student ' + str(i) for i in range(1,31)]
display(marks.head())

   Maths  Physics  Chemistry  Biology  Computer_Science    Student
0      2       87         38       40                85  Student 1
1     94       91         72       53                55  Student 2
2     20       42         62        2                79  Student 3
3     88       99         64       85                26  Student 4
4     58       99         28       98                91  Student 5

In [79]:
# Bring last column to first position
cols = marks.columns.tolist()
marks = marks[['Student','Chemistry', 'Biology', 'Computer_Science', 'Maths', 'Physics']]

In [80]:
marks.head(10)

      Student  Chemistry  Biology  Computer_Science  Maths  Physics
0   Student 1         38       40                85      2       87
1   Student 2         72       53                55     94       91
2   Student 3         62        2                79     20       42
3   Student 4         64       85                26     88       99
4   Student 5         28       98                91     58       99
5   Student 6          6       88                45      7       97
6   Student 7         16        7                80     27       75
7   Student 8         56       40                61     38       73
8   Student 9          1       66                46     50       25
9  Student 10         24       66                71     82        2

In [81]:
tidy = pd.melt(marks,
               id_vars = 'Student',
               value_name = 'Frequency')
tidy.head(10)

      Student   variable  Frequency
0   Student 1  Chemistry         38
1   Student 2  Chemistry         72
2   Student 3  Chemistry         62
3   Student 4  Chemistry         64
4   Student 5  Chemistry         28
5   Student 6  Chemistry          6
6   Student 7  Chemistry         16
7   Student 8  Chemistry         56
8   Student 9  Chemistry          1
9  Student 10  Chemistry         24

#### Applying Pandas Operations in Parallel

In [70]:
from pandarallel import pandarallel
from tqdm._tqdm_notebook import tqdm_notebook
tqdm_notebook.pandas()

In [72]:
pandarallel.initialize(progress_bar=True)

INFO: Pandarallel will run on 4 workers.
INFO: Pandarallel will use Memory file system to transfer data between the main process and workers.

In [73]:
df = pd.DataFrame({
    'A' : [random.randint(15,20) for i in range(1,1000000) ],
    'B' : [random.randint(10,30) for i in range(1,1000000) ]
})

In [74]:
def func(x):
    return math.sin(x.A**2) + math.sin(x.B**2) + math.tan(x.A**2)

WITHOUT PARALLELIZATION

In [75]:
%%time
res = df.progress_apply(func, axis=1)

HBox(children=(IntProgress(value=0, max=999999), HTML(value='')))

CPU times: user 55.3 s, sys: 315 ms, total: 55.6 s
Wall time: 55.3 s

WITH PARALLELIZATION

In [76]:
%%time
res_parallel = df.parallel_apply(func, axis=1)

VBox(children=(HBox(children=(IntProgress(value=0, description='0.00%', max=250000), Label(value='0 / 250000')…

CPU times: user 1.07 s, sys: 132 ms, total: 1.21 s
Wall time: 27.3 s